In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('olympics/summer.csv')

In [3]:
df.shape

(31165, 9)

In [4]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [5]:
# df['Athlete'].str.split(", ")
# df['Athlete'].str.split(", ").str[::-1]
# df['Athlete'].str.split(", ").str[::-1].str.join(" ")
df['Athlete'] = df['Athlete'].str.split(", ").str[::-1].str.join(" ").str.title()

In [6]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,Alfred Hajos,HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,Otto Herschmann,AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,Dimitrios Drivas,GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,Ioannis Malokinis,GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,Spiridon Chasapis,GRE,Men,100M Freestyle For Sailors,Silver

In [7]:
df.tail()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
31160,2012,London,Wrestling,Wrestling Freestyle,Damian Janikowski,POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,Ghasem Gholamreza Rezaei,IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,Rustam Totrov,RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,Artur Aleksanyan,ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,Jimmy Lidberg,SWE,Men,Wg 96 KG,Bronze

In [8]:
# 1. How many males and how many females are there ?
# 2. Which male athlete has won most medals ?
# 3. Which female athlete has won most medals ?
# 4. Print the Medal tally
# 5. Take India and Print Medal tally

In [9]:
men_df = df[df['Gender'] == 'Men']
women_df = df[df['Gender'] == 'Women']

In [10]:
# How many males and how many females are there ?
pd.value_counts(df['Gender'])

Men      22746
Women     8419
Name: Gender, dtype: int64

In [11]:
# Which male athlete has won most medals ?
pd.value_counts(men_df['Athlete']).head()

Michael Phelps         22
Nikolay Andrianov      15
Boris Shakhlin         13
Edoardo Mangiarotti    13
Takashi Ono            13
Name: Athlete, dtype: int64

In [12]:
# Which female athlete has won most medals ?
pd.value_counts(women_df['Athlete']).head()

Larisa Latynina     18
Dara Torres         12
Jenny Thompson      12
Birgit Fischer      12
Natalie Coughlin    12
Name: Athlete, dtype: int64

In [13]:
# Which male athlete has won most gold medals

In [14]:
# Which female athlete has won most gold medals

In [15]:
# Which male athlete has won most gold, bronze and silver ?

In [21]:
# Print medal tally of countries
medal_tally = df.groupby(['Country','Medal'])['Sport'].count().reset_index()

In [22]:
medal_tally.head()

  Country   Medal  Sport
0     AFG  Bronze      2
1     AHO  Silver      1
2     ALG  Bronze      8
3     ALG    Gold      5
4     ALG  Silver      2

In [25]:
# Use Pivot table to build this medal tally
pivot_df = medal_tally.pivot(index='Country',columns='Medal',values='Sport').fillna(0)

In [26]:
# Final results of pivot table
pivot_df.head()

Medal    Bronze  Gold  Silver
Country
AFG         2.0   0.0     0.0
AHO         0.0   0.0     1.0
ALG         8.0   5.0     2.0
ANZ         5.0  20.0     4.0
ARG        91.0  69.0    99.0

In [28]:
pivot_df.sort_values(by='Gold', ascending=False).head()

Medal    Bronze    Gold  Silver
Country
USA      1098.0  2235.0  1252.0
URS       584.0   838.0   627.0
GBR       553.0   546.0   621.0
ITA       404.0   476.0   416.0
GER       475.0   452.0   378.0